am32-firmware/AM32/Mcu/a153/Inc/mcxa153_rom_api.h
//! @brief Root of the bootloader API tree.
//!
//! An instance of this struct resides in read-only memory in the bootloader. It
//! provides a user application access to APIs exported by the bootloader.
//!
//! @note The order of existing fields must not be changed.
//!
//! @ingroup context

#pragma once

#ifndef MCU_A153_INC_MCXA153_ROM_API_H_
#define MCU_A153_INC_MCXA153_ROM_API_H_

/*! @brief Type used for all status and error return values. */
//typedef int32_t status_t;
//
///*! @brief Constructs the four character code for the Flash driver API key. */
//#if !defined(FOUR_CHAR_CODE)
//#define FOUR_CHAR_CODE(a, b, c, d) (((d) << 24) | ((c) << 16) | ((b) << 8) | ((a)))
//#endif
//
///*!
// * @brief Enumeration for Flash driver API keys.
// *
// * @note The resulting value is built with a byte order such that the string
// * being readable in expected order when viewed in a hex editor, if the value
// * is treated as a 32-bit little endian value.
// */
//enum _flash_driver_api_keys
//{
//    kFLASH_ApiEraseKey = FOUR_CHAR_CODE('l', 'f', 'e', 'k') /*!< Key value used to validate all flash erase APIs.*/
//};
//
///*! @brief Flash controller paramter config. */
//typedef struct _flash_ffr_config
//{
//    uint32_t ffrBlockBase;
//    uint32_t ffrTotalSize;
//    uint32_t ffrPageSize;
//    uint32_t sectorSize;
//    uint32_t cfpaPageVersion;
//    uint32_t cfpaPageOffset;
//} flash_ffr_config_t;
//
///*!
// * @brief Enumeration for various flash properties.
// */
//typedef enum _flash_property_tag
//{
//    kFLASH_PropertyPflashSectorSize    = 0x00U, /*!< Pflash sector size property.*/
//    kFLASH_PropertyPflashTotalSize     = 0x01U, /*!< Pflash total size property.*/
//    kFLASH_PropertyPflashBlockSize     = 0x02U, /*!< Pflash block size property.*/
//    kFLASH_PropertyPflashBlockCount    = 0x03U, /*!< Pflash block count property.*/
//    kFLASH_PropertyPflashBlockBaseAddr = 0x04U, /*!< Pflash block base address property.*/
//    kFLASH_PropertyPflashPageSize      = 0x30U, /*!< Pflash page size property.*/
//    kFLASH_PropertyPflashSystemFreq    = 0x31U, /*!< System Frequency property.*/
//    kFLASH_PropertyFfrSectorSize       = 0x40U, /*!< FFR sector size property.*/
//    kFLASH_PropertyFfrTotalSize        = 0x41U, /*!< FFR total size property.*/
//    kFLASH_PropertyFfrBlockBaseAddr    = 0x42U, /*!< FFR block base address property.*/
//    kFLASH_PropertyFfrPageSize         = 0x43U, /*!< FFR page size property.*/
//} flash_property_tag_t;
//
///*! @brief Flash driver state information.
//* An instance of this structure is allocated by the user of the flash driver and
//* passed into each of the driver APIs.
//*/
//typedef struct
//{
//	uint32_t PFlashBlockBase; 	/*!< A base address of the first PFlash block */
//	uint32_t PFlashTotalSize; 	/*!< The size of the combined PFlash block. */
//	uint32_t PFlashBlockCount; 	/*!< A number of PFlash blocks. */
//	uint32_t PFlashPageSize;	/*!< The size in bytes of a page of PFlash. */
//	uint32_t PFlashSectorSize; 	/*!< The size in bytes of a sector of PFlash. */
//	flash_ffr_config_t ffrConfig;
////	flash_mode_config_t modeConfig;
//} flash_config_t;
//
////! @brief Interface for the flash driver.
//typedef struct FlashDriverInterface
//{
//	// Flash driver
//	status_t (*flash_init) (flash_config_t *config);
//	status_t (*flash_erase_sector) (flash_config_t *config, uint32_t start, uint32_t lengthInBytes, uint32_t key);
//	status_t (*flash_program_phrase) (flash_config_t *config, uint32_t start, uint8_t *src, uint32_t lengthInBytes);
//	status_t (*flash_program_page) (flash_config_t *config, uint32_t start, uint8_t *src, uint32_t lengthInBytes);
//	status_t (*flash_verify_program) (flash_config_t *config,
//			uint32_t start,
//			uint32_t lengthInBytes,
//			const uint8_t *expectedData,
//			uint32_t *failedAddress,
//			uint32_t *failedData);
//	status_t (*flash_verify_erase_phrase) (flash_config_t *config, uint32_t start, uint32_t lengthInBytes);
//	status_t (*flash_verify_erase_page) (flash_config_t *config, uint32_t start, uint32_t lengthInBytes);
//	status_t (*flash_verify_erase_sector) (flash_config_t *config, uint32_t start, uint32_t lengthInBytes);
//	status_t (*flash_get_property) (flash_config_t *config, flash_property_tag_t whichProperty, uint32_t *value);
//	// IFR driver
//	status_t (*ifr_verify_erase_phrase) (flash_config_t *config, uint32_t start, uint32_t lengthInBytes);
//	status_t (*ifr_verify_erase_page) (flash_config_t *config, uint32_t start, uint32_t lengthInBytes);
//	status_t (*ifr_verify_erase_sector) (flash_config_t *config, uint32_t start, uint32_t lengthInBytes);
//	status_t (*flash_read) (flash_config_t *config, uint32_t start, uint8_t *dest, uint32_t lengthInBytes);
//	// version
//	uint32_t version; // !< flash driver API version number.
//}flash_driver_interface_t;
//
//typedef struct BootloaderTree
//{
//	void (*runBootloader) (void *arg);				// !< Function to start the bootloader executing.
//	const flash_driver_interface_t *flashDriver; 	// !< Internal Flash driver API.|
//} bootloader_tree_t;
//
//#define BOOTLOADER_TREE_LOCATION (0x03003fe0u)
//#define g_bootloaderTree ((bootloader_tree_t *)BOOTLOADER_TREE_LOCATION)

typedef int32_t status_t;

//TODO copied stuff from example
/*!
 * @name Flash status
 * @{
 */
/*! @brief Flash driver status group. */
#if defined(kStatusGroup_FlashDriver)
#define kStatusGroupGeneric     kStatusGroup_Generic
#define kStatusGroupFlashDriver kStatusGroup_FlashDriver
#elif defined(kStatusGroup_FLASHIAP)
#define kStatusGroupGeneric     kStatusGroup_Generic
#define kStatusGroupFlashDriver kStatusGroup_FLASH
#else
#define kStatusGroupGeneric     0
#define kStatusGroupFlashDriver 1
#endif

/*! @brief Constructs a status code value from a group and a code number. */
#if !defined(MAKE_STATUS)
#define MAKE_STATUS(group, code) ((((group) * 100) + (code)))
#endif

/*!
 * @brief Flash driver status codes.
 */
enum
{
    kStatus_FLASH_Success         = MAKE_STATUS(kStatusGroupGeneric, 0),     /*!< API is executed successfully*/
    kStatus_FLASH_InvalidArgument = MAKE_STATUS(kStatusGroupGeneric, 4),     /*!< Invalid argument*/
    kStatus_FLASH_SizeError       = MAKE_STATUS(kStatusGroupFlashDriver, 0), /*!< Error size*/
    kStatus_FLASH_AlignmentError =
        MAKE_STATUS(kStatusGroupFlashDriver, 1), /*!< Parameter is not aligned with the specified baseline*/
    kStatus_FLASH_AddressError = MAKE_STATUS(kStatusGroupFlashDriver, 2), /*!< Address is out of range */
    kStatus_FLASH_AccessError =
        MAKE_STATUS(kStatusGroupFlashDriver, 3), /*!< Invalid instruction codes and out-of bound addresses */
    kStatus_FLASH_ProtectionViolation = MAKE_STATUS(
        kStatusGroupFlashDriver, 4), /*!< The program/erase operation is requested to execute on protected areas */
    kStatus_FLASH_CommandFailure =
        MAKE_STATUS(kStatusGroupFlashDriver, 5), /*!< Run-time error during command execution. */
    kStatus_FLASH_UnknownProperty = MAKE_STATUS(kStatusGroupFlashDriver, 6), /*!< Unknown property.*/
    kStatus_FLASH_EraseKeyError   = MAKE_STATUS(kStatusGroupFlashDriver, 7)  /*!< API erase key is invalid.*/
};
/*@}*/

/*!
 * @brief Enumeration for various flash properties.
 */
typedef enum _flash_property_tag
{
    kFLASH_PropertyPflashSectorSize    = 0x00U, /*!< Pflash sector size property.*/
    kFLASH_PropertyPflashTotalSize     = 0x01U, /*!< Pflash total size property.*/
    kFLASH_PropertyPflashBlockSize     = 0x02U, /*!< Pflash block size property.*/
    kFLASH_PropertyPflashBlockCount    = 0x03U, /*!< Pflash block count property.*/
    kFLASH_PropertyPflashBlockBaseAddr = 0x04U, /*!< Pflash block base address property.*/
    kFLASH_PropertyPflashPageSize      = 0x30U, /*!< Pflash page size property.*/
    kFLASH_PropertyPflashSystemFreq    = 0x31U, /*!< System Frequency property.*/
    kFLASH_PropertyFfrSectorSize       = 0x40U, /*!< FFR sector size property.*/
    kFLASH_PropertyFfrTotalSize        = 0x41U, /*!< FFR total size property.*/
    kFLASH_PropertyFfrBlockBaseAddr    = 0x42U, /*!< FFR block base address property.*/
    kFLASH_PropertyFfrPageSize         = 0x43U, /*!< FFR page size property.*/
} flash_property_tag_t;

/*! @brief Flash controller paramter config. */
typedef struct _flash_ffr_config
{
    uint32_t ffrBlockBase;
    uint32_t ffrTotalSize;
    uint32_t ffrPageSize;
    uint32_t sectorSize;
    uint32_t cfpaPageVersion;
    uint32_t cfpaPageOffset;
} flash_ffr_config_t;

/*! @brief Flash driver state information.
 *
 * An instance of this structure is allocated by the user of the flash driver and
 * passed into each of the driver APIs.
 */
typedef struct _flash_config
{
    uint32_t PFlashBlockBase;  /*!< A base address of the first PFlash block */
    uint32_t PFlashTotalSize;  /*!< The size of the combined PFlash block. */
    uint32_t PFlashBlockCount; /*!< A number of PFlash blocks. */
    uint32_t PFlashPageSize;   /*!< The size in bytes of a page of PFlash. */
    uint32_t PFlashSectorSize; /*!< The size in bytes of a sector of PFlash. */
    flash_ffr_config_t ffrConfig;
} flash_config_t;

/*! @brief Interface for the flash driver. */
typedef struct _flash_driver_interface
{
    /* Flash driver */
    status_t (*flash_init)(flash_config_t *config);
    status_t (*flash_erase_sector)(flash_config_t *config, uint32_t start, uint32_t lengthInBytes, uint32_t key);
    status_t (*flash_program_phrase)(flash_config_t *config, uint32_t start, uint8_t *src, uint32_t lengthInBytes);
    status_t (*flash_program_page)(flash_config_t *config, uint32_t start, uint8_t *src, uint32_t lengthInBytes);
    status_t (*flash_verify_program)(flash_config_t *config,
                                     uint32_t start,
                                     uint32_t lengthInBytes,
                                     const uint8_t *expectedData,
                                     uint32_t *failedAddress,
                                     uint32_t *failedData);
    status_t (*flash_verify_erase_phrase)(flash_config_t *config, uint32_t start, uint32_t lengthInBytes);
    status_t (*flash_verify_erase_page)(flash_config_t *config, uint32_t start, uint32_t lengthInBytes);
    status_t (*flash_verify_erase_sector)(flash_config_t *config, uint32_t start, uint32_t lengthInBytes);
    status_t (*flash_get_property)(flash_config_t *config, flash_property_tag_t whichProperty, uint32_t *value);
    /* IFR driver */
#if !(defined(FSL_FEATURE_ROMAPI_IFR) && (FSL_FEATURE_ROMAPI_IFR == 0U))
    status_t (*ifr_verify_erase_phrase)(flash_config_t *config, uint32_t start, uint32_t lengthInBytes);
    status_t (*ifr_verify_erase_page)(flash_config_t *config, uint32_t start, uint32_t lengthInBytes);
    status_t (*ifr_verify_erase_sector)(flash_config_t *config, uint32_t start, uint32_t lengthInBytes);
#endif
    status_t (*flash_read)(flash_config_t *config, uint32_t start, uint8_t *dest, uint32_t lengthInBytes);
    /* version */
    uint32_t version;
} flash_driver_interface_t;

/*! @brief Constructs the four character code for the Flash driver API key. */
#if !defined(FOUR_CHAR_CODE)
#define FOUR_CHAR_CODE(a, b, c, d) (((d) << 24) | ((c) << 16) | ((b) << 8) | ((a)))
#endif

/*!
 * @brief Enumeration for Flash driver API keys.
 *
 * @note The resulting value is built with a byte order such that the string
 * being readable in expected order when viewed in a hex editor, if the value
 * is treated as a 32-bit little endian value.
 */
enum _flash_driver_api_keys
{
    kFLASH_ApiEraseKey = FOUR_CHAR_CODE('l', 'f', 'e', 'k') /*!< Key value used to validate all flash erase APIs.*/
};

/*   API prototype fields definition.
| 31 : 24   |    23 : 20        |     19 : 16        |  15 : 04  |  03 : 00        |
|    Tag    |   Boot mode       |   ISP interface    |  Reserved |  Image Index    |
|           |                   |                    |           |                 |
|           | 0: Passive mode   | 0 - Auto detection |           | For boot mode 0 |
|           | 1: ISP mode       | 1 - USB-HID        |           |                 |
|           |                   | 2 - UART           |           |                 |
|           |                   | 3 - SPI            |           |                 |
|           |                   | 4 - I2C            |           |                 |
|           |                   | 5 - CAN            |           |                 |
*/
typedef struct
{
    union
    {
        struct
        {
            uint32_t boot_image_index : 4;
            uint32_t reserved : 12;
            uint32_t boot_interface : 4;
            uint32_t mode : 4;
            uint32_t tag : 8;
        } B;
        uint32_t U;
    } option;
} user_app_boot_invoke_option_t;

/*! @brief Root of the bootloader API tree.
 *
 *  An instance of this struct resides in read-only memory in the bootloader. It
 *  provides a user application access to APIs exported by the bootloader.
 *
 */
typedef struct _bootloader_tree
{
    void (*run_bootloader)(void *arg);            /*!< Function to start the bootloader executing. */
    const flash_driver_interface_t *flash_driver; /*!< Internal Flash driver API. */
    void (*jump)(void *arg);
} bootloader_tree_t;

